# Напишите программу подсчёта количества элементов последовательности
# натуральных чисел, запись которых в шестнадцатеричной системе счисления
# трёхзначна и оканчивается на цифру 3. В ответе запишите количество искомых
# элементов.
#
# На вход программе сначала подаётся количество элементов последовательности
# N (1 ≤ N ≤ 1000), затем каждый элемент последовательности в отдельной строке.
#
# Программа должна напечатать только одно число – количество искомых
# элементов последовательности.

counter = 0

amount = int(input("Введите количество чисел: "))

for i in range(amount):
    number = int(input("Введите число: "))
    result = hex(number)[2:]
    if len(result) == 3 and result[-1] == "3":
        print(result)
        counter += 1

print(counter)
