# Напишите программу подсчёта количества элементов последовательности
# натуральных чисел, запись которых в шестнадцатеричной системе счисления
# трёхзначна и оканчивается на цифру C. В ответе запишите количество искомых
# элементов.
#
# Программа получает на вход натуральные числа. Количество введённых чисел
# неизвестно, но не превышает 1000. Последовательность чисел заканчивается
# числом 0 (0 – признак окончания ввода, не входит в последовательность).
# 
# Программа должна напечатать только одно число – количество искомых
# элементов последовательности.

counter = 0

while True:
    number = int(input("Введите число: "))
    result = hex(number)
    real_number = result[2:]
    if number == 0:
        break
    elif real_number[-1] == "c" and len(real_number) == 3:
        print(real_number)
        counter += 1

print(counter)

