# Напишите программу, которая в последовательности натуральных десятичных
# чисел определяет наибольший элемент, запись которого в системе счисления с
# основанием 7 оканчивается нечётной цифрой. Если среди входных данных таких
# элементов нет, программа должна вывести «NO».
#
# Программа получает на вход натуральные десятичные числа, не превышающие 30
# 000, каждое в отдельной строке. Количество введённых чисел неизвестно, их
# последовательность заканчивается числом 0 (0 – признак окончания ввода, в
# последовательность не входит).
#
# Программа должна вывести одно десятичное число – наибольший элемент
# последовательности, запись которого в 7-ричной системе счисления
# оканчивается нечётной цифрой, или «NO», если среди входных данных таких
# элементов нет.

data = []

while True:
    number = int(input("Введите число: "))
    if number == 0:
        break
    elif number % 7 in (1, 3, 5):
        data.append(number)

if len(data) > 0:
    print(max(data))
else:
    print("NO")
