# Напишите программу, которая в последовательности натуральных десятичных
# чисел определяет сумму элементов, запись которых в системе счисления с
# основанием 7 оканчивается цифрой 3. Если среди входных данных таких
# элементов нет, программа должна вывести «NO».
#
# Программа получает на вход в первой строке натуральное число – количество
# чисел N (3 ≤ N ≤ 10 000), затем N натуральных чисел, не превышающих 30 000,
# каждое в отдельной строке.
#
# Программа должна вывести одно число – сумму десятичных чисел (элементов
# последовательности), запись которых в 7-ричной системе счисления
# оканчивается цифрой 3, или «NO», если среди входных данных таких элементов
# нет.

total = 0
amount = int(input("Введите количество чисел: "))
data = []

for i in range(amount):
    number = int(input("Введите число: "))
    if number % 7 == 3:
        data.append(number)

if len(data) > 0:
    print(sum(data))
else:
    print("NO")
