# Дана последовательность натуральных чисел.
# Количество чисел в последовательности неизвестно.
# Ввод заканчивается числом 0, которое в последовательность не входит.

# Напишите программу, которая:
# определяет количество чисел последовательности, соответствующие условиям:
# - делятся на 7;
# - оканчиваются на цифру 3;
# - больше 100.

# Если таких чисел нет, программа должна вывести NO.
counter = 0

while True:
    number = int(input())
    if number == 0:
        break
    elif number % 7 == 0 and str(number)[-1] == "3" and number > 100:
        counter += 1

if counter > 0:
    print(counter)
else:
    print("NO")